app/Models/Prefecture.php

select * from `prefectures`
---
    public function getData()
    {
        $data = DB::table($this->table)->get();