app/Models/Product.php

    public function Products()
    {
        $products = Product::with('Productimage')
            ->join('productimages', 'product_id',  '=', 'products.id')
            ->where('productimages.kubun', 'main')
            ->select(
                'products.id',
                'products.name',
                'products.price',
                'products.category_master',
                'products.category',
                'products.capacity',
                'productimages.image',

            )
            //商品をランダムに12件取得
            ->inRandomOrder()
            ->take(12)
            ->get();
---
select * from `productimages` where `productimages`.`product_id` in ('11 イエロー main.jpg', '11 グリーン main.jpg', '11Pro ミッドナイトグリーン main.jpg', 'Note20 Ultra ブラック main.jpg', 'XR ブラック main.jpg', 'Xperia 1 II フロストブラック main.jpg', 'Xperia 1 II ホワイト main.jpg', 'Xperia 1 ブラック main.jpg', 'iPhone 12 グリーンmain.jpg', 'iPhone 12 ブラックmain.jpg', 'pro グラファイト main.jpg')