app/Models/Tax.php

    public function percentage()
    {
        $percentage = Tax::whereDate('taxes.from', '<=', Carbon::now()->format('Y-m-d'))
            ->orderby('taxes.from', 'desc')
            ->select(
                'taxes.percentage'
            )
            ->first();
---
select `percentage` from `taxes` where date(`taxes`.`from`) <= '2021-02-24' order by `taxes`.`from` desc